{"config":{"indexing":"full","lang":["en"],"min_search_length":3,"prebuild_index":false,"separator":"[\\s\\-]+","tags":false},"docs":[{"location":"","text":"<p>Lately I've been doing a lot of reading around Digital Gardens and how the concept might help me motivate myself to finally publish more online.</p> <p>In short, a Digital Garden is a cross between a blog and a collection of random notes. Less structed than a blog, but more of a knowledge graph of thoughts, ideas and collections.</p> <p>Since I've just started this, there's not much here right now.</p>","title":"Home"},{"location":"#about-me","text":"<p>I'm a Customer Engineer at Microsoft in Health and Life Sciences. </p> <p>Previously, I was the Spyglass Practice Lead at Catapult Systems, and prior to that I spent 20 years in Higher Education.</p>","title":"About Me"},{"location":"PowerShell/Notes%20on%20System.Collections.Generic%20in%20PowerShell/","text":"<p>For a lot of the reporting I need to do out of 365, I often end up with tons of data to parse.</p> <p>There's plenty written already about the benefits of System.Collections.Generic.List, but here's my notes.</p>","title":"Notes on System.Collections.Generic in PowerShell"},{"location":"PowerShell/Notes%20on%20System.Collections.Generic%20in%20PowerShell/#determining-if-a-item-exists","text":"<p>Using the Exists method we can search a List of Objects for a particular value. Useful for checking if an item exists.</p> <pre><code># Given an Generic List of [Objects]. Perfect for API results or CSVs\n$results = [System.Collections.Generic.List[pscustomobject]]::new()\n\n...\n\n# Look to see a value in a particular column exists.\n# Exists takes a predicate as its parameter.\n\n$results.Exists( { param($x) $x.ObjectId -eq '036dd45a-eeca-3c30-df80-08d9bd047d56'  })   \nTrue\n</code></pre> <p>The scriptblock as the parameter is the PowerShell equivalent of C#'s <pre><code>x =&gt; { ... }\n</code></pre></p> <p>This page has a wealth of examples on anonymous functions in PowerShell.</p>","title":"Determining if a item exists"},{"location":"Sentinel/AAD%20Sign-In%20Logs/","text":"<p>Normalizing AAD Signin Logs</p> <pre><code>let AADLogs = SigninLogs\n\n | where TimeGenerated &gt;= ago(30d) and UserPrincipalName contains \"@\"\n\n | extend ClientAppUsed = iff(isempty(ClientAppUsed) == true, \"Unknown\", ClientAppUsed)\n\n | extend isLegacyAuth = case(ClientAppUsed contains \"Browser\", tobool(\"False\"), ClientAppUsed contains \"Mobile Apps and Desktop clients\", tobool(\"False\"), ClientAppUsed contains \"Exchange ActiveSync\", tobool(\"True\"), ClientAppUsed contains \"Unknown\", bool(null), tobool(\"True\"))\n\n | extend OperatingSystem = tostring(DeviceDetail.operatingSystem)\n\n | extend Browser = tostring(DeviceDetail.browser)\n\n | extend OperatingSystemVersion = case(OperatingSystem contains \"Windows\", (split(OperatingSystem, \" \", 1)).[0], \"\")\n\n | extend DeviceID = tostring(DeviceDetail.deviceId)\n\n | extend TrustType = tostring(DeviceDetail.trustType)\n\n | extend Program = case(\n\n Browser contains \"Microsoft Office\", \"WinOffice\",\n\n Browser contains \"MacOutlook\", \"MacOffice\",\n\n Browser has_any(\"powerpnt\", \"outlook.exe\", \"winword\", \"excel\", \"mspub\", \"msaccess\", \"visio\", \"winproj\"), \"WinOffice\", // these occasionally show up\n\n Browser contains \"python\", \"Python\",\n\n Browser contains \"lync.exe\", \"Skype\",\n\n Browser contains \"Mobile Safari\", \"iOS Mail\",\n\n ClientAppUsed contains \"IMAP\", \"IMAP\",\n\n \"\")\n\n | extend ProgramVersion = case(\n\n // Office on Windows identifies as its internal version number\n\n Program == \"WinOffice\" and Browser contains \"Microsoft Office\", case(\n\n (split(Browser, \" \", 2)).[0] == \"16.0\", \"2016+\",\n\n (split(Browser, \" \", 2)).[0] == \"15.0\", \"2013\",\n\n (split(Browser, \" \", 2)).[0] == \"14.0\", \"2010\",\n\n (split(Browser, \" \", 2)).[0] == \"12.0\", \"2007\",\n\n (split(Browser, \" \", 2)).[0] == \"11.0\", \"2003\",\n\n \"\"),\n\n // Office on Mac identifies as its internal version number\n\n Program == \"MacOffice\" and Browser contains \"MacOutlook\", case(\n\n (split(Browser, \" \", 1)).[0] startswith \"16\", \"2019\",\n\n (split(Browser, \" \", 1)).[0] startswith \"15\", \"2016\",\n\n (split(Browser, \" \", 1)).[0] startswith \"14\", \"2011\",\n\n (split(Browser, \" \", 1)).[0] startswith \"12\", \"2008\",\n\n (split(Browser, \" \", 1)).[0] startswith \"11\", \"2004\",\n\n \"\"),\n\n \"\")\n\n | extend errorCode = toint(Status.errorCode)\n\n | extend SigninStatus = case(errorCode == 0, \"success\",\n\n errorCode in ('50058', '50058','50140','51006','50059','65001','52004','50055','50144','50072','50074','16000','16001','16003','50127','50125','50129','50143','81010','81014','81012'), 'interrupt',\n\n \"failure\")\n\n | extend Network = tostring(parse_json(tostring(parse_json(NetworkLocationDetails)[0].networkNames))[0])\n\n | order by TimeGenerated desc\n\n | project Id, CorrelationId, Network, IPAddress, TimeGenerated, UserPrincipalName, AppDisplayName, ClientAppUsed, TrustType, DeviceID, OperatingSystem, OperatingSystemVersion, Program, ProgramVersion, Browser, SigninStatus, ConditionalAccessStatus, AuthenticationRequirement, isLegacyAuth\n\n;\n\nAADLogs\n</code></pre>","title":"AAD Sign-In Log Normalization"},{"location":"Sentinel/Sharepoint%20One%20Time%20Code%20Access/","text":"<p>Trying to locate shares from SharePoint/One Drive to external users that result in the One Time Code instead of creating a guest account.</p> <p>Need to dig around some more on if this is accurate.</p> <pre><code>OfficeActivity | where EventSource == \"SharePoint\"\n| where Operation == \"AddedToSecureLink\" and TargetUserOrGroupType == \"Guest\"\n</code></pre>","title":"Sharepoint One Time Code Access"}]}